package codenames.server.application.services

import codenames.server.application.persistence.CardRepository
import codenames.server.domain.enums.GameColor
import codenames.server.infrastructure.jpa.JpaCard
import org.bson.types.ObjectId
import org.springframework.stereotype.Service
import kotlin.random.Random

@Service
class CardService(
    val cardRepository: CardRepository
) {
    fun generateCardPack(
        size: Int
    ): List<JpaCard> {
        return randomCards(size, 4,4,4)
    }

    val words: List<String> = listOf("АГЕНТ", "АКТ", "АКЦИЯ", "АЛЬБОМ", "АМФИБИЯ", "АППАРАТ", "БАБОЧКА", "БАЗА", "БАНК", "БАНЯ", "БАР", "БАРЬЕР", "БАССЕЙН", "БАТАРЕЯ", "БАШНЯ", "БЕЛОК", "БЕРЁЗА", "БИЛЕТ", "БИРЖА", "БЛОК", "БОБ", "БОЕВИК", "БОЛЬНИЦА", "БОМБА", "БОРТ", "БОТИНОК", "БОЧКА", "БРАК", "БУМАГА", "БУТЫЛКА", "БЫК", "БЫЧОК", "БЮСТ", "ВАЛ", "ВЕДЬМА", "ВЕНЕЦ", "ВЕРТОЛЁТ", "ВЕРФЬ", "ВЕТЕР", "ВИЛКА", "ВИРУС", "ВИСКИ", "ВОДА", "ВОЖДЬ", "ВОЛНА", "ВОР", "ВОРОТ", "ГАЗ", "ГАЗЕЛЬ", "ГАЛОП", "ГВОЗДЬ", "ГИГАНТ", "ГОЛОВА", "ГОЛЬФ", "ГРАНАТ", "ГРЕБЕНЬ", "ГРИФ", "ГРУША", "ГУБА", "ГУСЕНИЦА", "ДАМА", "ДАЧА", "ДВОР", "ДВОРНИК", "ДИСК", "ДОЛГ", "ДРАКОН", "ДРОБЬ", "ДЫРА", "ЕДИНОРОГ", "ЖИЛА", "ЗАБОР", "ЗАВОД", "ЗАЛИВ", "ЗАМОК", "ЗАЯЦ", "ЗВЕЗДА", "ЗЕБРА", "ЗЕМЛЯ", "ЗМЕЙ", "ЗОЛОТО", "ЗОНА", "ИГЛА", "ИКРА", "ИНСТИТУТ", "КАБАЧОК", "КАБИНЕТ", "КАДР", "КАЗИНО", "КАМЕНЬ", "КАМЕРА", "КАНАЛ", "КАРАУЛ", "КАРЛИК", "КАРТА", "КАТОК", "КАША", "КЕНГУРУ", "КЕНТАВР", "КЕТЧУП", "КИВИ", "КИСТЬ", "КИТ", "КЛАСС", "КЛЕТКА", "КЛЮЧ", "КОЛ", "КОЛОДА", "КОЛОННА", "КОЛЬЦО", "КОРЕНЬ", "КОРОЛЕВА", "КОРОЛЬ", "КОРОНА", "КОСА", "КОСЯК", "КОШКА", "КРАН", "КРЕПОСТЬ", "КРОЛИК", "КРОНА", "КРОШКА", "КРУГ", "КРЫЛО", "КУЛАК", "КУРС", "ЛАДЬЯ", "ЛАЗЕР", "ЛАМА", "ЛАСКА", "ЛЕВ", "ЛЕГЕНДА", "ЛЁД", "ЛЕС", "ЛИМУЗИН", "ЛИНИЯ", "ЛИПА", "ЛИРА", "ЛИЦО", "ЛОЖЕ", "ЛОПАТКА", "ЛОТ", "ЛОШАДЬ", "ЛУК", "МАНДАРИН", "МАРКА", "МАРШ", "МАСЛО", "МАТ", "МЕДВЕДЬ", "МИКРОСКОП", "МИНА", "МИР", "МОЛНИЯ", "МОЛЬ", "МОРКОВЬ", "МОТИВ", "МУШКА", "НАЛЁТ", "НАРЯД", "НЕБОСКРЁБ", "НОМЕР", "НОРКА", "НОТА", "НЯНЯ", "ОБЛОМ", "ОБРАЗОВАНИЕ", "ОБРЕЗ", "ОВСЯНКА", "ОЛИМП", "ОПЕРА", "ОРГАН", "ОРДЕН", "ОРЁЛ", "ОСЬМИНОГ", "ОЧКИ", "ПАДЕНИЕ", "ПАНАМА", "ПАРА", "ПАРАШЮТ", "ПАРК", "ПАРТИЯ", "ПАТРОН", "ПАУК", "ПЕРЕВОД", "ПЕРО", "ПЕЧАТЬ", "ПИЛОТ", "ПИРАТ", "ПИСТОЛЕТ", "ПЛАТА", "ПЛАТЬЕ", "ПЛОМБА", "ПЛОЩАДЬ", "ПОВАР", "ПОГОН", "ПОДКОВА", "ПОДЪЁМ", "ПОЛ", "ПОЛЕ", "ПОМПА", "ПОРТ", "ПОСОЛ", "ПОСТ", "ПОТОК", "ПОЧКА", "ПРАВО", "ПРЕДЛОЖЕНИЕ", "ПРИЗРАК", "ПРИНЦЕССА", "ПРИШЕЛЕЦ", "ПРОБКА", "ПРОВОДНИК", "ПРОКАТ", "ПРОСПЕКТ", "ПУТЬ", "ПУШКИН", "ПЯТАЧОК", "РАЗВОД", "РАЗВОРОТ", "РАЗРЯД", "РАСТВОР", "РИФ", "РОБОТ", "РОГ", "РОД", "РОК", "РУБАШКА", "РУБКА", "РУЛЕТКА", "РУЧКА", "РЫБА", "РЫСЬ", "РЫЦАРЬ", "САЛЮТ", "САНТЕХНИК", "САЧОК", "СВЕЧА", "СВИДЕТЕЛЬ", "СЕКРЕТ", "СЕТЬ", "СКАТ", "СНАРЯД", "СНЕГ", "СНЕГОВИК", "СОБАКА", "СОЛДАТ", "СОЛЬ", "СПЛАВ", "СПУТНИК", "ССЫЛКА", "СТАВКА", "СТАДИОН", "СТАНОК", "СТВОЛ", "СТЕКЛО", "СТЕНА", "СТОЛ", "СТОПКА", "СТРЕЛА", "СТРОЧКА", "СТРУНА", "СТУЛ", "СЪЕЗД", "ТАЗ", "ТАКСА", "ТАКТ", "ТАНЕЦ", "ТАРЕЛКА", "ТЕЛЕГА", "ТЕЛЕСКОП", "ТИТАН", "ТОК", "ТРЕУГОЛЬНИК", "ТРУБА", "ТУР", "УДАРНИК", "УЗЕЛ", "УТКА", "УЧЁНЫЙ", "УЧИТЕЛЬ", "ФАКЕЛ", "ФАЛАНГА", "ФИНКА", "ФЛЕЙТА", "ХЛОПОК", "ЦИЛИНДР", "ЧЕСТЬ", "ШАЙБА", "ШАЙКА", "ШАР", "ШАХ", "ШАШКА", "ШИШКА", "ШОКОЛАД", "ШПАГАТ", "ШПИОН", "ШУБА", "ЭЛЬФ", "ЯБЛОКО", "ЯЗЫК", "ЯЧМЕНЬ")

    fun randomCards (count: Int, _black: Int, _white: Int, teamsCount: Int): List<JpaCard> {
        val eachTeamColorCount = (count - _black - _white) / teamsCount
        val white = _white + (count - _black - _white) % teamsCount
        val cards = mutableListOf<JpaCard>()
        for (i in 0 until white) {
            val word = words[Random.nextInt(words.size)];
            cards.add(JpaCard(ObjectId.get(), word, GameColor.WHITE, Random.nextBoolean()));
        }
        for (i in 0 until _black) {
            val word = words[Random.nextInt(words.size)];
            cards.add(JpaCard(ObjectId.get(),word, GameColor.BLACK, false));
        }
        for (i in 0 until teamsCount) {
            for (j in 0 until eachTeamColorCount) {
            val word = words[Random.nextInt(words.size)];
            cards.add(JpaCard(ObjectId.get(),word, GameColor.values()[i], Random.nextBoolean()));
        }
        }
        cards.shuffle()
        return cards
    }
}
